test1_localhost_hello.xml
<?xml version="1.0"?>
   <!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
   <tsung loglevel="warning">
   <clients>
      <client host="localhost" cpu="1" maxusers="30000000"/>
   </clients>
   <servers>
      <server host="localhost" port="8080" type="tcp"/>
   </servers>
   <load>
      <arrivalphase phase="1" duration="1" unit="minute">
         <users arrivalrate="1" unit="second"/>
      </arrivalphase>
    </load>
   <sessions>
      <session name="es_load" weight="1" type="ts_http">
         <request>
            <http url="/hello" method="GET"/>
         </request>
      </session>
   </sessions>
 </tsung>